"""Арифметические действия над числами пронумерованы следующим образом: 1 —
сложение, 2 — вычитание, 3 — умножение, 4 — деление. Дан номер действия N
(целое число в диапазоне 1-4) и вещественные числа A и B (В не равно 0). Выполнить
над числами указанное действие и вывести результат."""

N = int(input("Введите номер действия (1-4): "))
A = float(input("Введите первое число: "))
B = float(input("Введите второе число: "))

if N == 1:
    C = A + B
elif N == 2:
    C = A - B
elif N == 3:
    C = A * B
elif N == 4:
    C = A / B
else:
    print("Ошибка! Неверный номер действия.")

if N >= 1 and N <= 4:
    print("Результат:", C)