"""Вариант 9. Даны целые положительные числа A и B (A > B). На отрезке длины A
размещено максимально возможное количество отрезков длины B (без наложений).
Используя операцию деления нацело, найти количество отрезков B, размещенных на
отрезке A."""

while True:
    try:
        # Нужно ввести целые положительные числа A и B
        A = int(input('Введите число A: '))
        B = int(input('Введите число B: '))

        if A > 0 and B > 0 and A > B:
            break
        else:
            print('Ошибка! A и B должны быть положительными, а A должно быть больше B!')

    except ValueError:
        print('Ошибка! Введите целые числа!')

# Находим количество отрезков длины B
count = A // B

# Выводим результат
print(f'Количество отрезков длины B: {count}')